Revit 2024 API
BuiltInFailures.DividedSurfaceFailures.DividedSurfaceCurveChainIntersection Property
 A chain formed by these curve elements intersects other chain with the same grid orientation. Both chains will be ignored
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId DividedSurfaceCurveChainIntersection { get; }
Visual Basic
Public Shared ReadOnly Property DividedSurfaceCurveChainIntersection As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ DividedSurfaceCurveChainIntersection {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.DividedSurfaceFailures Class
Autodesk.Revit.DB Namespace